DataProcessors/АктивацияБонусныхБаллов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>АктивацияБонусныхБаллов</Name>
			<Comment>Активация бонусных баллов</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗаписьЭлектроннойПочты</Name>
					<Comment>Учетная запись</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонРассылкиSMS</Name>
					<Comment>Шаблон рассылки SMS</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонРассылкиEMail</Name>
					<Comment>Шаблон рассылки E-Mail</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументыКОтправкеSMS</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументыКОтправкеПисем</Name>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаРассылок</Name>
					<Comment>Таблица рассылок</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Comment>Контрагент</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БонуснаяПрограмма</Name>
							<Comment>Бонусная программа</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.БонусныеПрограммы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БонуснаяКарта</Name>
							<Comment>Бонусная карта</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Карточки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСписания</Name>
							<Comment>Дата списания</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SMS</Name>
							<Comment>Есть SMS</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Email</Name>
							<Comment>Есть E-Mail</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Телефон</Name>
							<Comment>Телефон</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Comment>Адрес</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/АктивацияБонусныхБаллов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ШаблоныСообщений

// Используемое имя в подсистеме ШаблоныСообщений
//
Функция ИмяПредметаШаблонаСообщения() Экспорт
	
	Возврат "АктивацияБонусныхБаллов";
	
КонецФункции

// Вызывается при подготовке шаблонов сообщений и позволяет переопределить список реквизитов и вложений.
//
// Параметры:
//  Реквизиты               - ДеревоЗначений - список реквизитов шаблона.
//         ** Имя            - Строка - Уникальное имя общего реквизита.
//         ** Представление  - Строка - Представление общего реквизита.
//         ** Тип            - Тип    - Тип реквизита. По умолчанию строка.
//         ** Формат         - Строка - Формат вывода значения для чисел, дат, строк и булевых значений.
//  Вложения                - ТаблицаЗначений - печатные формы и вложения
//         ** Имя            - Строка - Уникальное имя вложения.
//         ** Представление  - Строка - Представление варианта.
//         ** ТипФайла       - Строка - Тип вложения, который соответствует расширению файла: "pdf", "png", "jpg", mxl"
//                                      и др.
//  ДополнительныеПараметры - Структура - дополнительные сведения о шаблоне сообщений.
//
Процедура ПриПодготовкеШаблонаСообщения(Реквизиты, Вложения, ДополнительныеПараметры) Экспорт
	
	// Заполним только теми полями, что доступны для шаблона
	Реквизиты.Очистить();
	
	НовыйРеквизит = Реквизиты.Добавить();
	НовыйРеквизит.Имя = "ТаблицаРассылок.Контрагент";
	НовыйРеквизит.Представление = НСтр("ru = 'Контрагент'");
	НовыйРеквизит.Тип = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
	
	НовыйРеквизит = Реквизиты.Добавить();
	НовыйРеквизит.Имя = "ТаблицаРассылок.БонуснаяПрограмма";
	НовыйРеквизит.Представление = НСтр("ru = 'Бонусная программа'");
	НовыйРеквизит.Тип = Новый ОписаниеТипов("СправочникСсылка.БонусныеПрограммы");
	
	НовыйРеквизит = Реквизиты.Добавить();
	НовыйРеквизит.Имя = "ТаблицаРассылок.БонуснаяКарта";
	НовыйРеквизит.Представление = НСтр("ru = 'Бонусная карта'");
	НовыйРеквизит.Тип = Новый ОписаниеТипов("СправочникСсылка.Карточки");
	
	НовыйРеквизит = Реквизиты.Добавить();
	НовыйРеквизит.Имя = "ТаблицаРассылок.Количество";
	НовыйРеквизит.Представление = НСтр("ru = 'Количество'");
	НовыйРеквизит.Тип = Новый ОписаниеТипов("Число");
	
	НовыйРеквизит = Реквизиты.Добавить();
	НовыйРеквизит.Имя = "ТаблицаРассылок.ДатаСписания";
	НовыйРеквизит.Представление = НСтр("ru = 'Дата списания'");
	НовыйРеквизит.Тип = Новый ОписаниеТипов("Дата");
	
КонецПроцедуры

// Вызывается в момент создания сообщений по шаблону для заполнения значений реквизитов и вложений.
//
// Параметры:
//  Сообщение - Структура - структура с ключами:
//    * ЗначенияРеквизитов - Соответствие - список используемых в шаблоне реквизитов.
//      ** Ключ     - Строка - имя реквизита в шаблоне;
//      ** Значение - Строка - значение заполнения в шаблоне.
//    * ЗначенияОбщихРеквизитов - Соответствие - список используемых в шаблоне общих реквизитов.
//      ** Ключ     - Строка - имя реквизита в шаблоне;
//      ** Значение - Строка - значение заполнения в шаблоне.
//    * Вложения - Соответствие - значения реквизитов 
//      ** Ключ     - Строка - имя вложения в шаблоне;
//      ** Значение - ДвоичныеДанные, Строка - двоичные данные или адрес во временном хранилище вложения.
//  ПредметСообщения - ЛюбаяСсылка - ссылка на объект являющийся источником данных.
//  ДополнительныеПараметры - Структура -  Дополнительная информация о шаблоне сообщения.
//
Процедура ПриФормированииСообщения(Сообщение, ПредметСообщения, ДополнительныеПараметры) Экспорт
	
	СтрокаДанных = ПолучитьЗначениеПараметраСтруктуры(Сообщение.ДополнительныеПараметры.ПараметрыСообщения, "СтрокаДанныхРассылки");
	
	Если СтрокаДанных = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТабличнаяЧасть = Сообщение.ЗначенияРеквизитов.Получить("ТаблицаРассылок");
	
	Если ТабличнаяЧасть = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Контрагент = ТабличнаяЧасть.Получить("Контрагент");
	Если Контрагент <> Неопределено Тогда
		СформироватьСтруктуруЗначений(Контрагент, СтрокаДанных.Контрагент);
	КонецЕсли;
	
	БонуснаяПрограмма = ТабличнаяЧасть.Получить("БонуснаяПрограмма");
	Если БонуснаяПрограмма <> Неопределено Тогда
		СформироватьСтруктуруЗначений(БонуснаяПрограмма, СтрокаДанных.БонуснаяПрограмма);
	КонецЕсли;
	
	БонуснаяКарта = ТабличнаяЧасть.Получить("БонуснаяКарта");
	Если БонуснаяКарта <> Неопределено Тогда
		СформироватьСтруктуруЗначений(БонуснаяКарта, СтрокаДанных.БонуснаяКарта);
	КонецЕсли;
	
	Количество = ТабличнаяЧасть.Получить("Количество");
	Если Количество <> Неопределено Тогда
		ТабличнаяЧасть.Вставить("Количество", Строка(СтрокаДанных.Количество));
	КонецЕсли;
	
	ДатаСписания = ТабличнаяЧасть.Получить("ДатаСписания");
	Если ДатаСписания <> Неопределено Тогда
		ТабличнаяЧасть.Вставить("ДатаСписания", Формат(СтрокаДанных.ДатаСписания, "ДФ='dd.MM.yyyy'"));
	КонецЕсли;
	
	Сообщение.ЗначенияРеквизитов.Вставить("ТаблицаРассылок", ТабличнаяЧасть);
	
КонецПроцедуры

// Заполняет список получателей SMS при отправке сообщения сформированного по шаблону.
//
// Параметры:
//   ПолучателиSMS - ТаблицаЗначений - список получается SMS.
//     * НомерТелефона - Строка - номер телефона, куда будет отправлено сообщение SMS.
//     * Представление - Строка - представление получателя сообщения SMS.
//     * Контакт       - Произвольный - контакт, которому принадлежит номер телефона.
//  ПредметСообщения - ЛюбаяСсылка, Структура - ссылка на объект являющийся источником данных, либо структура,
//                                              если шаблон содержит произвольные параметры:
//    * Предмет               - ЛюбаяСсылка - ссылка на объект являющийся источником данных
//    * ПроизвольныеПараметры - Соответствие - заполненный список произвольных параметров.
//
Процедура ПриЗаполненииТелефоновПолучателейВСообщении(ПолучателиSMS, ПредметСообщения) Экспорт
	
КонецПроцедуры

// Заполняет список получателей письма при отправки сообщения сформированного по шаблону.
//
// Параметры:
//   ПолучателиПисьма - ТаблицаЗначений - список получается письма.
//     * Адрес           - Строка - адрес электронной почты получателя.
//     * Представление   - Строка - представление получается письма.
//     * Контакт         - Произвольный - контакт, которому принадлежит адрес электронной почты.
//  ПредметСообщения - ЛюбаяСсылка, Структура - ссылка на объект являющийся источником данных, либо структура,
//                                              если шаблон содержит произвольные параметры:
//    * Предмет               - ЛюбаяСсылка - ссылка на объект являющийся источником данных
//    * ПроизвольныеПараметры - Соответствие - заполненный список произвольных параметров.
//
Процедура ПриЗаполненииПочтыПолучателейВСообщении(ПолучателиПисьма, ПредметСообщения) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ШаблоныСообщений

Процедура СформироватьСтруктуруЗначений(Параметр, Данные)
	
	СписокРеквизитов = Новый Массив;
	
	Для Каждого ТекущийПараметр Из Параметр Цикл
		СписокРеквизитов.Добавить(ТекущийПараметр.Ключ);
	КонецЦикла;
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Данные, 
		СтрСоединить(СписокРеквизитов, ","));
	Для Каждого Реквизит Из ЗначенияРеквизитов Цикл
		Параметр[Реквизит.Ключ] = Реквизит.Значение;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
